app/controllers/admin/leases_controller.rb

SELECT "leases".* FROM "leases"
---
  def index
    @leases = Lease.all

SELECT "properties".* FROM "properties"
SELECT "types".* FROM "types"
---
  def new
    @lease = Lease.new
    @titulo="Nuevo arrendamiento"
    @properties=Property.all
    @types=Type.all

SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @lease = Lease.find(params[:id])

INSERT INTO "leases" ("created_at", "descripcion", "num_int", "precio", "profile_id", "status_renta", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lease = Lease.new(params[:lease])
    respond_to do |format|
      if @lease.save

SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "leases" SET "descripcion" = 'asd', "updated_at" = '2012-07-21 15:44:52.046535' WHERE "leases"."id" = 1
---
  def update
    @lease = Lease.find(params[:id])
    respond_to do |format|
      if @lease.update_attributes(params[:lease])

SELECT "leases".* FROM "leases"
---
  def tab
    @leases = Lease.all