app/controllers/admin/localities_controller.rb

SELECT "localities".* FROM "localities"
---
  def index
    @titulo = "Lista de localidades"
    @localities = Locality.all

SELECT "localities".* FROM "localities" WHERE "localities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @titulo = "Actualizar localidad"
    @locality = Locality.find(params[:id])

INSERT INTO "localities" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 21 Jul 2012 15:00:06 UTC +00:00], ["name", "Cancun"], ["updated_at", Sat, 21 Jul 2012 15:00:06 UTC +00:00]]
---
  def create
    @titulo = "Agregar Localidad"
    @locality = Locality.new(params[:locality])
    respond_to do |format|
      if @locality.save

SELECT "localities".* FROM "localities" WHERE "localities"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "localities" SET "name" = 'Can', "updated_at" = '2012-07-21 15:17:13.771474' WHERE "localities"."id" = 1
---
  def update
    @titulo = "Actualizar localidad"
    @locality = Locality.find(params[:id])
    respond_to do |format|
      if @locality.update_attributes(params[:locality])

SELECT "localities".* FROM "localities" WHERE "localities"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "localities" WHERE "localities"."id" = ?  [["id", 3]]
---
  def destroy
    @locality = Locality.find(params[:id])
    @locality.destroy

SELECT "localities".* FROM "localities"
---
  def tab
    @titulo = "Lista de localidades"
    @localities = Locality.all