app/controllers/admin/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @profile = Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @profile = Profile.find(params[:id])

INSERT INTO "profiles" ("banos", "cocina", "created_at", "cuarto", "descripcion", "nombre", "property_id", "recamaras", "sala", "type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(params[:profile])
    respond_to do |format|
      if @profile.save

SELECT "profiles".* FROM "profiles"
---
  def tab
    @profiles = Profile.all