app/controllers/admin/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def show
    @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @property = Property.new(params[:property])
    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("address", "catastral_reference", "created_at", "description", "google_maps", "locality_id", "name", "owner", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @property = Property.find(params[:id])
    @property.destroy
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 2]]

  def tab
    @properties = Property.all
---
SELECT "properties".* FROM "properties"