app/controllers/admin/types_controller.rb

SELECT "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @type = Type.find(params[:id])

SELECT "types".* FROM "types"
---
 def tab
    @types = Type.all