app/views/admin/profiles/show.html.erb

    <% @profile.photos.each do |image| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."profile_id" = 1