app/views/pages/_enrenta.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."profile_id" = 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1
---
			<div class="ContenedorImagenes center">
				<% leas.profile.photos.each do |image| %>