app/views/pages/show.html.erb

    <% @lease.profile.photos.each do |image| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."profile_id" = 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = 1 LIMIT 1

    <strong>Servicios: </strong>
 <% @lease.profile.property.services.each do |ser| %>
---
SELECT "services".* FROM "services" WHERE "services"."property_id" = 1