app/controllers/pages_controller.rb

  def home
    @titulo = "Home"
    @leases=Lease.where('status_renta'=> false)
---
SELECT "leases".* FROM "leases" WHERE "leases"."status_renta" = 'f'

  def show
        @lease = Lease.find(params[:id])
---
SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]