app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @video = Video.find(params[:id])

INSERT INTO "videos" ("created_at", "descripcion", "updated_at", "url") VALUES (?, ?, ?, ?)
---
  def create
    @video = Video.new(params[:video])
    respond_to do |format|
      if @video.save