app/views/admin/properties/show.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."property_id" = 1
---
<div>
    <% @property.pictures.each do |image| %>